In [24]:
import pandas as pd

data={
    'Refund': ['Yes', 'No', 'No', 'Yes', 'No', 'No', 'Yes', 'No', 'No', 'No'],
    'Marital Status': ['Single', 'Married', 'Single', 'Married', 'Divorced', 'Married', 'Divorced', 'Single', 'Married', 'Single'],
    'Taxable Income': ['125K', '100K', '70K', '120K', '95K', '60K', '220K', '85K', '75K', '90K'],
    'Cheat': ['No', 'No', 'No', 'No', 'Yes', 'No', 'No', 'Yes', 'No', 'Yes']
}

df=pd.DataFrame(data)
print(df)

  Refund Marital Status Taxable Income Cheat
0    Yes         Single           125K    No
1     No        Married           100K    No
2     No         Single            70K    No
3    Yes        Married           120K    No
4     No       Divorced            95K   Yes
5     No        Married            60K    No
6    Yes       Divorced           220K    No
7     No         Single            85K   Yes
8     No        Married            75K    No
9     No         Single            90K   Yes

In [25]:
rows = df.loc[[0,4,7,8]]
print(rows)

  Refund Marital Status Taxable Income Cheat
0    Yes         Single           125K    No
4     No       Divorced            95K   Yes
7     No         Single            85K   Yes
8     No        Married            75K    No

In [26]:
row=df.iloc[3:8]
print(row)

  Refund Marital Status Taxable Income Cheat
3    Yes        Married           120K    No
4     No       Divorced            95K   Yes
5     No        Married            60K    No
6    Yes       Divorced           220K    No
7     No         Single            85K   Yes

In [27]:
row_column=df.iloc[4:9 , 2:5]
print(row_column)

  Taxable Income Cheat
4            95K   Yes
5            60K    No
6           220K    No
7            85K   Yes
8            75K    No

In [28]:
column=df.iloc[:, 1:4]
print(column)

  Marital Status Taxable Income Cheat
0         Single           125K    No
1        Married           100K    No
2         Single            70K    No
3        Married           120K    No
4       Divorced            95K   Yes
5        Married            60K    No
6       Divorced           220K    No
7         Single            85K   Yes
8        Married            75K    No
9         Single            90K   Yes

In [30]:
import pandas as pd
import zipfile

with zipfile.ZipFile("iris.zip", 'r') as z:
    print(z.namelist())
    
    with z.open("Iris.csv") as f:
        df = pd.read_csv(f)

print(df.head())

['Iris.csv', 'database.sqlite']
   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [31]:
df=pd.read_csv("Iris.csv")
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [37]:
df=pd.read_csv("Iris.csv")
df=df.drop(index=4)
df=df.drop(df.columns[2],axis=1)
print(df.head())

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1            1.4           0.2  Iris-setosa
1   2            4.9            1.4           0.2  Iris-setosa
2   3            4.7            1.3           0.2  Iris-setosa
3   4            4.6            1.5           0.2  Iris-setosa
5   6            5.4            1.7           0.4  Iris-setosa

In [38]:
data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Edward'],
    'Department': ['HR', 'IT', 'IT', 'Marketing', 'Sales'],
    'Age': [29, 34, 41, 28, 38],
    'Salary': [50000, 70000, 65000, 55000, 60000],
    'Years_of_Experience': [4, 8, 10, 3, 12],
    'Joining_Date': ['2020-03-15', '2017-07-19', '2013-06-01', '2021-02-10', '2010-11-25'],
    'Gender': ['Female', 'Male', 'Male', 'Female', 'Male'],
    'Bonus': [5000, 7000, 6000, 4500, 5000],
    'Rating': [4.5, 4.0, 3.8, 4.7, 3.5]
}

df=pd.DataFrame(data)

df.to_csv("employees.csv",index=False)

In [39]:
df=pd.read_csv("employees.csv")
shape = df.shape
print(shape)

(5, 10)

In [44]:
info=df.info()
print(info)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [45]:
print(df.describe(include = 'all'))

        Employee_ID   Name Department        Age       Salary  \
count      5.000000      5          5   5.000000      5.00000
unique          NaN      5          4        NaN          NaN
top             NaN  Alice         IT        NaN          NaN
freq            NaN      1          2        NaN          NaN
mean     103.000000    NaN        NaN  34.000000  60000.00000
std        1.581139    NaN        NaN   5.612486   7905.69415
min      101.000000    NaN        NaN  28.000000  50000.00000
25%      102.000000    NaN        NaN  29.000000  55000.00000
50%      103.000000    NaN        NaN  34.000000  60000.00000
75%      104.000000    NaN        NaN  38.000000  65000.00000
max      105.000000    NaN        NaN  41.000000  70000.00000

        Years_of_Experience Joining_Date Gender   Bonus    Rating
count              5.000000            5      5     5.0  5.000000
unique                  NaN            5      2     NaN       NaN
top                     NaN   2020-03-15   Male     NaN       NaN
freq                    NaN            1      3     NaN       NaN
mean               7.400000          NaN    NaN  5500.0  4.100000
std                3.847077          NaN    NaN  1000.0  0.494975
min                3.000000          NaN    NaN  4500.0  3.500000
25%                4.000000          NaN    NaN  5000.0  3.800000
50%                8.000000          NaN    NaN  5000.0  4.000000
75%               10.000000          NaN    NaN  6000.0  4.500000
max               12.000000          NaN    NaN  7000.0  4.700000

In [46]:
print(df.head())
print(df.tail(3))

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [50]:
avg_salary=df['Salary'].mean()
bonus=df['Bonus'].sum()
young_emp=df['Age'].min()
highest_rating=df['Rating'].max()
print(avg_salary)
print(bonus)
print(young_emp)
print(highest_rating)

60000.0
27500
28
4.7

In [58]:
sorted_data=df.sort_values(by='Salary',ascending=False)
print(sorted_data)

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

In [59]:
def categorize_rating(rating):
    if rating >= 4.5:
        return 'Excellent'
    elif rating >= 4.0:
        return 'Good'
    else:
        return 'Average'

df['Performance'] = df['Rating'].apply(categorize_rating)

In [60]:
print(df.isnull().sum())

Employee_ID            0
Name                   0
Department             0
Age                    0
Salary                 0
Years_of_Experience    0
Joining_Date           0
Gender                 0
Bonus                  0
Rating                 0
Performance            0
dtype: int64

In [61]:
df.rename(columns={'Employee_ID': 'ID'}, inplace=True)

In [62]:
exp_filter = df[df['Years_of_Experience'] > 5]
it_filter = df[df['Department'] == 'IT']
print(exp_filter)
print(it_filter)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average
4   Male   5000     3.5     Average
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average

In [63]:
df['Tax'] = df['Salary'] * 0.10
print(df)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance     Tax
0  Female   5000     4.5   Excellent  5000.0
1    Male   7000     4.0        Good  7000.0
2    Male   6000     3.8     Average  6500.0
3  Female   4500     4.7   Excellent  5500.0
4    Male   5000     3.5     Average  6000.0

In [68]:
df.to_csv("modified_employees.csv", index=False)
print("Modified DataFrame saved to 'modified_employees.csv'")

Modified DataFrame saved to 'modified_employees.csv'